{
  "basics": {
    "name": "Yingying Sun",
    "label": "Researcher",
    "image": "prof_pic.jpg",
    "email": "syy963@connect.hku.hk",
    "phone": "",
    "url": "https://github.com/blingblingSyy",
    "summary": "",
    "location": {
      "address": "Rm 622 Haking Wong Building, The University of Hong Kong",
      "postalCode": "",
      "city": "Hong Kong",
      "countryCode": "",
      "region": ""
    },
    "profiles": [
      {
        "network": "",
        "username": "",
        "url": ""
      }
    ]
  },
  "research ": [
    {
      "name": "Faculty of Business and Economics, The University of Hong Kong",
      "position": "Research Assistant",
      "url": "",
      "startDate": "2022-02-01",
      "endDate": "2022-05-01",
      "summary": "Modeled emergency service routing and capacity allocation with limited vehicle, hard time windows and multiple round trips, in order to minimize the total waiting time costs and unsaved demands. Compared the separated routing schemes and the integrated routing schemes, to find out the influence of the combination of vehicles on the delivery efficiency. Designed Genetic Algorithm with cross-over and mutation strategies after splitting the demands and encoding the vehicle’s trajectory.",
      "highlights": ["Emergency Service Routing", "Genetic Algorithm Design", "Efficiency Analysis"]
    }    
  ],
  "work": [
    {
      "name": "Huawei Corporation",
      "position": "Data Engineer, AI module of Procurement Data Management Department",
      "url": "",
      "startDate": "2022-07-01",
      "endDate": "2022-12-01",
      "summary": "Participated in the design of production scheduling tools, optimizing the suppliers’ capacity adjustment with daily production quantities, assisting in supplier risk control and demand plan evaluation. Used a production flow network to capture each item group's flow across sections, and constructed three large-scale mixed integer programming models in hierarchy. Designed an object-oriented code structure and created a register which enables dynamic modeling. Explored an algorithmic combination of Lagrangian Decomposition and column generation to accelerate the solution, which relaxes the flow-balance constraint to the target and disintegrates the parallel capacity for each item group.",
      "highlights": ["Production Scheduling Tool Design", "Risk Control", "Demand Plan Evaluation"]
    },
    {
      "name": "Xiaomi Corporation",
      "position": "Project Management Intern, AI Department",
      "url": "",
      "startDate": "2021-01-01",
      "endDate": "2021-03-01",
      "summary": "Responsible for the project of Xiao Ai smart watch version update, divided the repair work by product function, and designed Gantt chart to control and visualize the project cycle in determination of important handover time points. Regularly sorted the bugs in processing by product functions and visualized the bug processing speed with box plot, in order to find out the work that affect the overall project process.",
      "highlights": ["Project Management", "Gantt Chart", "Bug Processing"]
    },
    {
      "name": "Kraftheinz (China) Investment Ltd.",
      "position": "Online Biding Procurement Assistant",
      "url": "",
      "startDate": "2020-06-01",
      "endDate": "2020-09-01",
      "summary": "Responsible for risk controlling and bidding price monitoring to analyze and alleviate the information asymmetry of suppliers for the first party. Filtered the suitable candidates from the massive raw data in terms of their past business with the company; Retrieved historical prices of similar projects to construct reasonable ranges of the bidding prices and wrote a VBA program to automatically filter excessive or low prices; Participated in supplier evaluation from multiple dimensions to form a comparison chart of candidate supplier qualifications, and to score them with weights, preparing for future cooperations.",
      "highlights": ["Risk Control", "Price Monitoring", "Supplier Evaluation"]
    },
    {
      "name": "Johnson & Johnson (China) Investment Ltd.",
      "position": "Part-time Assistant for Sourcing Manager",
      "url": "",
      "startDate": "2019-12-01",
      "endDate": "2020-02-01",
      "summary": "Classification: used VBA to classify products into different purchase category by filtering out and extracting the key words in the product description or identifying similar features in product clusters; Forecasting: used exponential smoothing model as benchmark model to forecast the price of raw materials based on ten years’ data and visualize the pricing trend of the product.",
      "highlights": ["Product Classification", "Price Forecasting", "Data Visualization"]
    }
  ],
  "volunteer": [
  ],
  "education": [
    {
      "institution": "The University of Hong Kong",
      "location": "Hong Kong, China",
      "url": "https://www.hku.hk/",
      "area": "Business Analytics",
      "studyType": "Master's Degree",
      "startDate": "2021-08-01",
      "endDate": "2022-07-01",
      "score": "3.82",
      "courses": [
        "Data Science"
      ]
    },
    {
      "institution": "Wuhan University",
      "location": "Wuhan, China",
      "url": "https://www.whu.edu.cn/",
      "area": "Logistics Management",
      "studyType": "Bachelor's Degree",
      "startDate": "2017-08-01",
      "endDate": "2021-06-01",
      "score": "3.64",
      "courses": [
        "Science in Logistics Management"
      ]
    },
    {
      "institution": "University of British Columbia",
      "location": "Vancouver, Canada",
      "url": "https://www.ubc.ca/",
      "area": "Business Analytics; Operations and Supply Chain Strategy",
      "studyType": "Exchange Program",
      "startDate": "2019-07-01",
      "endDate": "2019-08-01",
      "score": "",
      "courses": [
        "Business Analytics", 
        "Operations and Supply Chain Strategy"
      ]
    }
  ],
  "certificates": [
  ],
  "publications": [
  ],
  "skills": [
    {
      "name": "Transport Studies",
      "level": "Novice Researcher",
      "icon": "",
      "keywords": [
        "Systems Engineering",
        "Operations Research",
        "Logistics and Supply Chain Management",
        "Transportation Planning and Policy",
        "Software Development",
        "Data Analysis and Modeling",
        "Artificial Intelligence and Machine Learning",
        "Sustainability and Environmental Impact"
      ]
    }
  ],
  "languages": [
    {
      "language": "Mandarin",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Cantonese",
      "fluency": "Conversational",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Transport Studies",
      "icon": "",
      "keywords": [
        "Systems Engineering",
        "Operations Research",
        "Logistics and Supply Chain Management",
        "Transportation Planning and Policy",
        "Software Development",
        "Data Analysis and Modeling",
        "Artificial Intelligence and Machine Learning",
        "Sustainability and Environmental Impact"
      ]
    }
  ],
  "references": [
    {
      "name": "Professor Szeto, Wai Yuen",
      "icon": "fa-solid fa-thumbtack",
      "reference": ""
    }
  ],
  "projects": [
    {
      "name": "Systematic Methods of Logistics Optimization for YOHO",
      "summary": "Designed an efficient logistics distribution system from a monthly integrated perspective with uploaded pricing contracts and daily orders, giving recommendations based on the features of each logistics order. A 2-stage framework was proposed to first classify the distribution and then heuristically transfer orders among all 3PLs given capacity constraints of each party. Our recommendation system not only improved process automation for YOHO but also helped reduce logistics costs by about 4%.",
      "highlights": ["Logistics System Design", "Cost Reduction", "Process Automation"],
      "startDate": "2022-06-01",
      "endDate": "2022-06-01",
      "url": ""
    },
    {
      "name": "Face Detection with User Interaction and Local Style Transfer",
      "summary": "Adopted the Face Detection Data Set and Benchmark (FDDB), preprocessed image data by transforming ellipse bounding boxes to rectangles, converting image channels to RGB mode, and padding images to equal size. Trained with Single Shot Detector to achieve multi-face detection within one picture and designed a Graphical Interface for users to extract the target face for local style transformations. Achievements include enabling users to select, edit, and apply styles to faces in images.",
      "highlights": ["Face Detection", "User Interaction", "Style Transfer"],
      "startDate": "2022-04-01",
      "endDate": "2022-04-01",
      "url": ""
    },
    {
      "name": "House Price Estimation (Kaggle Competition)",
      "summary": "Utilized Pyspark on Databricks to clean data and establish various machine learning models, such as Lasso Regression and Xgboost, to estimate house prices. Defined a benchmark model with Comparative Market Analysis combined with KNN by a balancing coefficient to simulate variations of pricing bias in the traditional real estate industry. Achieved accuracy of over 85% with Xgboost, ranking in the top 15% in the Kaggle competition.",
      "highlights": ["Machine Learning", "Real Estate Analysis", "Kaggle Competition"],
      "startDate": "2022-02-01",
      "endDate": "2022-02-01",
      "url": ""
    },
    {
      "name": "A study on OBM’s procurement outsourcing strategy under information asymmetry and product substitutability",
      "summary": "Explored OBM's procurement strategies when outsourcing to a competitive supplier under cost information asymmetry in a three-tier supply chain. Modeled the problem as a game of reverse selection and redesigned the contract setting for OBM, finding conditions for an economically efficient contract that satisfies both incentive compatibility and individual rationality constraints, reaching equilibrium in the quantity game. This study also discusses the impact of information asymmetry on procurement strategies.",
      "highlights": ["Procurement Strategy", "Game Theory", "Contract Design"],
      "startDate": "2021-04-01",
      "endDate": "2021-04-01",
      "url": ""
    },
    {
      "name": "The 5th National College Logistics Simulation Design Competition",
      "summary": "Developed optimization strategies by conducting logistics simulations on a cloud platform, involving commodity similarity analysis for storage region arrangement, using ABC classification for commodity orders, and determining the procurement strategy for each type of commodity based on order frequency. Constructed a robot picking route optimization model by balancing total operation costs and fair assignment of tasks among robots, considering robot power consumption constraints. Won 1st Prize of Provincial Trails in the competition.",
      "highlights": ["Logistics Simulation", "Robot Route Optimization", "Competition Winner"],
      "startDate": "2019-11-01",
      "endDate": "2019-11-01",
      "url": ""
    }
  ]
}
